snlkuharlocal/src/InformationRegisters/СтатусГотовностиКОтгрузкеЧЗ/СтатусГотовностиКОтгрузкеЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусГотовностиКОтгрузкеЧЗ</name>
  <resources>
    <name>СтатусЧЗ</name>
    <type>
      <types>EnumRef.СтатусыГотовностиКОтгрузкеЧЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/ОтложенныеДвиженияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеДвиженияДокументов</name>
  <resources>
    <name>Движения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>КоличествоЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Добавлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаВыполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.УстановкаСтатусаКМ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_БезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Прочее</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ИспользованиеДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Конфискация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоОбразцам</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_РозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Уничтожение</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утилизация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утрата</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ДистанционнаяПродажа</name>
    <comment>Возврат при дистанционном способе продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей</name>
    <comment>Возврат товара, выведенного изоборота  для  производственных целей</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд</name>
    <comment>Возврат товара, выведенного из оборота для собственных нужд</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи</name>
    <comment>Возврат в оборот возврат приобретение не для перепродажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПродажаЧерезВендинг</name>
    <comment>Возврат товара, выведенного из оборота для продажи  через  вендинговый аппарат</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_РозничнаяРеализация</name>
    <comment>Возврат при розничной реализации</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
    <comment>Отгрузка в ЕАЭС</comment>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Испорчен</name>
    <comment>Списание не нанесееных КМ. Испорчен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Уничтожен</name>
    <comment>Списание не нанесееных КМ. Уничтожен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Утерян</name>
    <comment>Списание не нанесееных КМ. Утерян.</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ</name>
    <comment>RETAIL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ_ДистПродажи</name>
    <comment>REMOTE_SALE_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратОтКонечногоПокупателя</name>
    <comment>LEGAL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС</name>
    <comment>EEC_EXPORT_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ИспорченоЛибоУтеряно</name>
    <comment>KM_SPOILED</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыГотовностиКОтгрузкеЧЗ/СтатусыГотовностиКОтгрузкеЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГотовностиКОтгрузкеЧЗ</name>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/CommonModules/ОбменСЧЗЧерезОУКЭП/Module.bsl
//Валетов + 29,01,25 Обмен с ЧЗ С использованием ОУКЭП
//ПараметрыРегламентногоЗадания 	По имени 	ВидОбработки 
// 1 - Отправка документов в ЧЗ  2- получение ответа по отправленным документам.
Процедура ОтправитьДокуметыНаОбработкуВЧЗ(ТаблицаПараметров = Неопределено) Экспорт
	
	ВидЗапускаОбработки = 1; //ПО умолчанию 1
	
	Если ТаблицаПараметров <> Неопределено Тогда
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			Если СтрокаТП.Имя = "ВидОбработки" Тогда				
				//Если СтрокаТП.Представление = "ВидОбработки" Тогда
				ВидЗапускаОбработки = СтрокаТП.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Если ВидЗапускаОбработки = 3 Тогда
		АвтоматическаяОбработкаАгрегаций();
		
		Если инт_ДлительныеОперации.ЭтоФоновоеЗадание() Тогда
			ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();			
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	СписокПолучателей = Новый СписокЗначений;
	Сертификаты = ПолучитьСписокСертификатовСИНН();
	
	ЗаписатьВЛог("Обмен с ЧЗ (ОУКЭП)", "Получено сертификатов ЭЦП: " + Сертификаты.Количество(), "Информация");

	ДокументыОтправлены = Новый  Массив;
	ЕстьОшибки = Ложь;
	ТекстПисьма = "";
	ДокОшибки = Неопределено;
	
	Для Каждого Серт Из Сертификаты Цикл
		ОбработкаАПИ = Обработки.АпиЧЗ.Создать();
		
		СУЗ = ПолучитьСУЗПоОрганизации(Серт.Представление);
		ОрганизацияСуз = Суз.Владелец;
		
		ВидыОпераций = Новый Массив;
		ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа);
		ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.ФормированиеНабора);
		//Валетов+ 18,06,2025 Добавил отправку Расформирваний Упаковки, для обработки Расформированных Паллет
		//https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5282
		ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки);  
		//Валетов + 14,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3493
		Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.ТрансформацияУпаковки_Добавление);
		КонецЕсли;
		//Валтов -
		Если ВидЗапускаОбработки = 2 Тогда
			ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.Агрегация);
			//ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки);
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка,
		|	МаркировкаТоваровИСМП.ВидОперации КАК ВидОперации,
		|	МаркировкаТоваровИСМП.ВидОперацииИСМП КАК ВидОперацииИСМП,
		|	МаркировкаТоваровИСМП.Организация КАК Организация,
		|	МаркировкаТоваровИСМП.Статус КАК Статус
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|ГДЕ
		|	МаркировкаТоваровИСМП.ВидОперацииИСМП В(&ВидОперации)
		|	И МаркировкаТоваровИСМП.Проведен
		|	И МаркировкаТоваровИСМП.Статус = &Статус
		|	И МаркировкаТоваровИСМП.Организация = &Организация
		|	И МаркировкаТоваровИСМП.Дата МЕЖДУ &ДатаНач И &ДатаОкон
		|
		|УПОРЯДОЧИТЬ ПО
		|	МаркировкаТоваровИСМП.Дата";
		
		Запрос.УстановитьПараметр("ВидОперации", ВидыОпераций);
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()-86400*11));
		Запрос.УстановитьПараметр("ДатаОкон", ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", ОрганизацияСуз);
		Запрос.УстановитьПараметр("Статус", ?(ВидЗапускаОбработки = 1,Перечисления.СтатусыДокументовМаркировки.КОбработке,Перечисления.СтатусыДокументовМаркировки.Обрабатывается));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
				
		ТекстСообщения = СтрШаблон("Оправка док-ов. Организация: %1, отпечаток ЭЦП: %2, кол-во док-ов: %3.", ОрганизацияСуз, Серт.Значение, Выборка.Количество());
		ЗаписатьВЛог("Обмен с ЧЗ (ОУКЭП)", ТекстСообщения, "Информация");	
		
	//	пОбработки = Новый Структура("СУЗ,ОтпечатокСертификатаЭЦП", СУЗ, Серт.Значение);
		
		Если Выборка.Количество() > 0 Тогда
			//+++Чирков 16.06.2025 
			//Токен =  ОбработкаАПИ.ПолучитьТокен_СУЗ(Суз,Серт.Значение);
			//ТокенТруАпи= ОбработкаАПИ.ПолучитьТокен_TrueApi(Серт.Значение,ОрганизацияСуз);			
			
			//ОбработкаАПИ.Токен_СУЗ = Токен;
			//ОбработкаАПИ.Токен_TrueApi = ТокенТруАпи;
			//ОбработкаАПИ.Организация = ОрганизацияСуз;
			
			//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "Токен_СУЗ", Токен);
			//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ТокенТруАпи", ТокенТруАпи);
			//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ОтпечатокСертификатаЭЦП",Серт.Значение);
			//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ТекущаяСУЗ",Суз);			
			
			пОбработки = Новый Структура("СУЗ,ОтпечатокСертификатаЭЦП", СУЗ, Серт.Значение);
			
			//--Чирков 16.06.2025
			
			Пока Выборка.Следующий() Цикл
				Если ВидЗапускаОбработки = 1 Тогда
					//++Данилова Е.В. 18.08.2025 MARK-1756 
					РезультатПроверки = Документы.МаркировкаТоваровИСМП.РезультатПроверкиОбработкиРасформированияНабораГНпоЗСБ(Выборка.ссылка);
					Если НЕ РезультатПроверки.Успешно Тогда
					
						Продолжить; 	
					
					КонецЕсли;
					//--Данилова Е.В. 18.08.2025
                    //Валетов + 28,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#OUT-187 
					Если ЕстьДокументВОтложенныхДвижениях(Выборка.Ссылка) Тогда
						Продолжить;
					Иначе
						РезультатОбработки = ОбработкаАПИ.ОтправитьНаОбработку_ОперМаркировки(Выборка.Ссылка, пОбработки);
					КонецЕсли;
				   //Валетов -
				ИначеЕсли ВидЗапускаОбработки = 2 Тогда
					//+++Чирков 16.06.2025
					//РезультатОбработки = ОбработкаАПИ.ПолучитьРезультаты_ОперМаркировки(Выборка.Ссылка, ХранилищеОбщихНастроек);
					РезультатОбработки = ОбработкаАПИ.ПолучитьРезультаты_ОперМаркировки(Выборка.Ссылка, пОбработки);
					//---Чирков 16.06.2025
				КонецЕсли;
				
				Попытка
					СтрокаЗапроса = "ping -n 1 -w "+Формат(1000 * 1, "ЧДЦ=0; ЧГ=") + " 127.255.255.255"; 
					WshShell = Новый COMОбъект("WScript.Shell"); 
					WshShell.Run(СтрокаЗапроса, 0, -1);
				Исключение
				КонецПопытки;
				
				Если НЕ РезультатОбработки.Успешно Тогда
					//+++ Чирков 16.08.2025 
					//ЕстьОшибки = Истина;
					ЕстьОшибки = РезультатОбработки.Ошибки.Количество()>0 И НЕ МаркировкаКС.ЕстьОшибка404(РезультатОбработки); 
					Если ЕстьОшибки Тогда						
					//--- Чирков 16.08.2025
						ДокОшибки = Выборка.Ссылка;
						Если ТранзакцияАктивна() Тогда
							ОтменитьТранзакцию(); 
						КонецЕсли; 
						ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
						Если НЕ ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки Тогда						
							ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки;						
							
							Если РезультатОбработки.Ошибки.Количество() > 0 Тогда
								ДокОбъект.ТекстОшибки = СтрСоединить(РезультатОбработки.Ошибки, " ");
							КонецЕсли;
							Попытка	
								//+++Чирков 2025.04.28 - зачем перепроводить документ с ошибкой ?
								ДокОбъект.Записать();
								//+++Чирков 2025.04.28
							Исключение
								ДокОбъект.ОбменДанными.Загрузка = Истина;
								ДокОбъект.Записать();
							КонецПопытки;
						КонецЕсли;     
						//Валетов + 03,12,2025 ПУСТАЯ ЗАДАЧА
						//БЫЛО
						//ТекстПисьма = ТекстПисьма + " Ошибка обработки документа: № " + Выборка.Ссылка.Номер + " от "+ Выборка.Ссылка.Дата +"  Описание Ошибки: " +РезультатОбработки.Ошибки[0]  + Символы.ПС; 
						ТекстПисьма = " Ошибка обработки документа: № " + Выборка.Ссылка.Номер + " от "+ Выборка.Ссылка.Дата +"  Описание Ошибки: " +РезультатОбработки.Ошибки[0]  + Символы.ПС;
						//Валетов + 12,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3187
						ТемаПисьма = "Ошибки регламентного задания при обработке документов для ЧЗ в базе  " + Маркировка_ПИ.ЭтотУзел_Код();
						ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибки);
					КонецЕсли;
				Иначе
					ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
					Если ВидЗапускаОбработки = 2 И НЕ ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
						ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан;
						Попытка	
							ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							ДокОбъект.ОбменДанными.Загрузка = Истина;
							ДокОбъект.Записать();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;                                                          			
			КонецЦикла;
		КонецЕсли;			
	КонецЦикла;
	
	//Валетов + 12,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3187 Перенес выше, чтоб отправлять 1 ошибка = 1 письмо
	//Если ЕстьОшибки Тогда
	//	ТемаПисьма = "Ошибки регламентного задания при обработке документов для ЧЗ в базе  " + Маркировка_ПИ.ЭтотУзел_Код();
	//	ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибки);
	//КонецЕсли; 
	
	Если инт_ДлительныеОперации.ЭтоФоновоеЗадание() Тогда
		ОценкаПроизводительностиКлиентСервер.ЗаписатьКэшЛогов();			
	КонецЕсли;	
КонецПроцедуры

Процедура АвтоматическаяОбработкаАгрегаций()  		
	
	ОбработкаАПИ = Обработки.АпиЧЗ.Создать();
	Сертификаты = ПолучитьСписокСертификатовСИНН();
	
	ДокументыОтправлены = Новый  Массив;
	ЕстьОшибки = истина;
	ДокОшибки = Неопределено;
	ТекстПисьма = "";
	СписокПолучателей = Новый СписокЗначений;
	
	Для Каждого Серт Из Сертификаты Цикл
		//	ОрганизацияСуз = Справочники.Организации.НайтиПоРеквизиту("ИНН",СокрЛП(Серт.Представление));
		
		СУЗ = ПолучитьСУЗПоОрганизации(Серт.Представление);
		ОрганизацияСуз = Суз.Владелец;
		
		//+++ Чирков 16.06.2025
		//Токен =  ОбработкаАПИ.ПолучитьТокен_СУЗ(Суз,Серт.Значение);
		//ТокенТруАпи= ОбработкаАПИ.ПолучитьТокен_TrueApi(Серт.Значение,ОрганизацияСуз);
		//
		//ОбработкаАПИ.Токен_СУЗ = Токен;
		//ОбработкаАПИ.Токен_TrueApi = ТокенТруАпи;
		//ОбработкаАПИ.Организация = ОрганизацияСуз;
		//
		//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "Токен_СУЗ", Токен);
		//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ТокенТруАпи", ТокенТруАпи);
		//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ОтпечатокСертификатаЭЦП",Серт.Значение);
		//ХранилищеОбщихНастроек.Сохранить("АпиЧЗ", "ТекущаяСУЗ",Суз);		
		
		пОбработки = Новый Структура("СУЗ,ОтпечатокСертификатаЭЦП", СУЗ, Серт.Значение);
		
		//--- Чирков 16.06.2025
		
		ЗапросРНК = Новый Запрос;
		ЗапросРНК.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусГотовностиКОтгрузкеЧЗ КАК СтатусГотовностиКОтгрузкеЧЗ
		|		ПО (СтатусГотовностиКОтгрузкеЧЗ.Документ = РасходнаяНакладная.Ссылка)
		|ГДЕ
		|	РасходнаяНакладная.Проведен
		|	И (РасходнаяНакладная.СостояниеНакладной = ЗНАЧЕНИЕ(перечисление.СостоянияНакладной.ГотоваКОтгрузке) 
		//Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404
		|			ИЛИ РасходнаяНакладная.СостояниеНакладной = ЗНАЧЕНИЕ(перечисление.СостоянияНакладной.ОжиданиеОбработкиЧЗ)) 
		//Валетов -
		|	И (РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака <> ЗНАЧЕНИЕ(Справочник.ПравилаАгрегацииЧестногоЗнака.пустаяСсылка)
		|			ИЛИ РасходнаяНакладная.ПравилаАгрегацииЧестногоЗнака.Наименование <> ""Не требуется"")
		|	И РасходнаяНакладная.Организация = &Орг
		|	И ЕСТЬNULL(СтатусГотовностиКОтгрузкеЧЗ.СтатусЧЗ, ЗНАЧЕНИЕ(перечисление.СтатусыГотовностиКОтгрузкеЧЗ.ОжиданиеОбработкиЧЗ)) <> ЗНАЧЕНИЕ(перечисление.СтатусыГотовностиКОтгрузкеЧЗ.Обработано)
		|	И РасходнаяНакладная.ТребуетсяМаркировка = ИСТИНА
		|	И РасходнаяНакладная.ДатаОтгрузки >= &Дата" ;
		ЗапросРНК.УстановитьПараметр("Орг", ОрганизацияСуз);
		ЗапросРНК.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()-86400*11));
		РезПоРНК = ЗапросРНК.Выполнить().Выбрать();
		
		//берем все РНК и проверяем
		Пока РезПоРНК.Следующий() Цикл
			//По Десткому миру Агрегации не отправлять. Петров запретил.
			Если СокрЛП(РезПоРНК.Ссылка.Контрагент.Код) = "SST-0259" Тогда 
				//Валетов + 30,04,2025
				//Добавил Запись в регистр обработанных документов, чтоб потом он не лез в выборку.
				НаборЗаписей = РегистрыСведений.СтатусГотовностиКОтгрузкеЧЗ.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(РезПоРНК.Ссылка);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Документ = РезПоРНК.Ссылка;
				Иначе
					НоваяЗапись = НаборЗаписей[0];
				КонецЕсли;
				
				НоваяЗапись.СтатусЧЗ = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.Обработано;
				НаборЗаписей.Записать();
				//Валетов -
				Продолжить;
			КонецЕсли;
			
			ЕстьОшибки = Ложь;
			
			ВидыОпераций = Новый Массив;
			ВидыОпераций.Добавить(Перечисления.ВидыОперацийИСМП.Агрегация);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка КАК Ссылка,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки) КАК КоличествоШтрихкодовУпаковки,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки) КАК КоличествоШтрихкодовКоробки,
			//++Данилова Е.В. 19.06.2025 HELP-5109 
			|	СУММА(ВЫБОР
			|			КОГДА МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК КоличествоШКДляПроверки,
			//--Данилова Е.В. 19.06.2025

			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование.КоличествоДокумента КАК КоличествоРНК,
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование КАК РНК,
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Статус КАК Статус
			|ИЗ
			|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
			|ГДЕ
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование = &Док
			|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Проведен
			|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
			//|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Вработе)
			|
			|СГРУППИРОВАТЬ ПО
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка,
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование.КоличествоДокумента,
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование,
			|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Статус
			|
			|УПОРЯДОЧИТЬ ПО
			|	РНК,
			|	КоличествоШтрихкодовУпаковки УБЫВ,
			|	КоличествоШтрихкодовКоробки УБЫВ";
			
			Запрос.УстановитьПараметр("Док", РезПоРНК.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			ВсеДокументыОбработаны = Ложь;
			
			Сч = 0; //Используется чтоб понимать какой уровень агрегации сейчас обрабатывается. 
			//Проверяем все созданные Операции Маркировки по одной РНК 
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.Обработан Тогда
					ВсеДокументыОбработаны = Истина;
					Сч = Сч + 1;
					Продолжить;
				ИначеЕсли Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.Обрабатывается
					ИЛИ   Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки 
					ИЛИ   Выборка.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
					ВсеДокументыОбработаны = Ложь;
					Сч = Сч + 1;
					Прервать;
				КонецЕсли;
				ВсеДокументыОбработаны = Ложь;
				//++Данилова Е.В. 02.04.2026 MARK-3539 
				//++Данилова Е.В. 19.06.2025 HELP-5109 
				//КолШКЗаранееАгрегированных = МаркировкаС.КоличествоШКПоЗаранееСформированнымАгрегациям(РезПоРНК.Ссылка);
				КолШКЗаранееАгрегированных = МаркировкаС.КоличествоШКПоЗаранееСформированнымАгрегациямДоГотовоКОтгрузке(РезПоРНК.Ссылка);
				//--Данилова Е.В. 02.04.2026 			
				//Если СЧ = 0 и НЕ Выборка.КоличествоРНК = Выборка.КоличествоШтрихкодовУпаковки Тогда
				Если СЧ = 0 и НЕ Выборка.КоличествоРНК = (Выборка.КоличествоШКДляПроверки + КолШКЗаранееАгрегированных) Тогда
					//--Данилова Е.В. 19.06.2025  
					//Валетов + 16,04,2026 Добавил проверку количества для Заранее собранных Коробов по письму Сазонова
					Если Выборка.КоличествоРНК > ПроверитьТоварыПоРНК(РезПоРНК.Ссылка) Тогда
						ДокОшибки = РезПоРНК.Ссылка;
						ЕстьОшибки = истина;
						ТекстПисьма = ТекстПисьма + " РНК: № " + РезПоРНК.Ссылка.Номер + " от "+ РезПоРНК.Ссылка.Дата +Символы.ПС +" В агрегациях не совпадает общее количество вложенных единиц товара с тем, что заявлено в РНК ("+ (Выборка.КоличествоРНК - Выборка.КоличествоШтрихкодовУпаковки)+"шт). Просьба проверить собранные агрегации в ЛП/ЛН"+Символы.ПС;
						СписокПолучателей.Добавить("adminschastsy@collant.ru");
						СписокПолучателей.Добавить("ovlto@collant.ru");
						//СписокПолучателей.Добавить("Valetov@collant.ru");
						Сч = Сч + 1;                           
						//Валетов + 12,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3187
						ТемаПисьма = "Ошибки регламентного задания при обработке Агрегаций "+ДокОшибки+ " по РНК "+ РезПоРНК.Ссылка +"  в базе  " + Маркировка_ПИ.ЭтотУзел_Код();
						ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибки);
						Прервать;  
					КонецЕсли; 
					//Валетов-
				КонецЕсли;				
				//Если Сч = 0 Тогда 
				//	ДокРазагрегации = СделатьРазагрегацию(Выборка.Ссылка,ХранилищеОбщихНастроек,ТекстПисьма);
				//	Если ЗначениеЗаполнено(ДокРазагрегации) Тогда
				//		РезультатОбработки = ОбработкаАПИ.ОтправитьНаОбработку_ОперМаркировки(ДокРазагрегации,ХранилищеОбщихНастроек);
				//		
				//		Если НЕ РезультатОбработки.Успешно Тогда
				//			ЕстьОшибки = истина;
				//			ТекстПисьма = ТекстПисьма + " Ошибка обработки документа: № " + Выборка.Ссылка.Номер + " от "+ Выборка.Ссылка.Дата +"  Описание Ошибки: " +РезультатОбработки.Ошибки[0]  + Символы.ПС;
				//			
				//		КонецЕсли;
				//		Прервать;//Создали и отправили Разагрегацию, значит заканчиваем цикл по Агрегациям этой РНК, ими займемся потом
				//	КонецЕсли;
				//КонецЕсли;
				
				Сч = Сч + 1;
				
				//Валетов + 28,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#OUT-187 
				Если ЕстьДокументВОтложенныхДвижениях(Выборка.Ссылка) Тогда
					Прервать;
				Иначе
					РезультатОбработки = ОбработкаАПИ.ОтправитьНаОбработку_ОперМаркировки(Выборка.Ссылка, пОбработки);
				КонецЕсли;
				//Валетов -
				
				Если НЕ РезультатОбработки.Успешно Тогда
					ДокОшибки = Выборка.Ссылка;
					ЕстьОшибки = истина;
					Если ТранзакцияАктивна() Тогда
						ОтменитьТранзакцию(); 
					КонецЕсли;	
					ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
					
					ДокОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.ОшибкаОбработки;
					Если РезультатОбработки.Ошибки.Количество() > 0 Тогда
						ДокОбъект.ТекстОшибки = СтрСоединить(РезультатОбработки.Ошибки, " ");
					КонецЕсли;
					Попытка
						//+++Чирков 2025.04.28 - зачем перепроводить документ с ошибкой ?
						//ДокОбъект.Записать(?(ДокОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
						ДокОбъект.Записать();
						//---Чирков 2025.04.28
					Исключение
						ДокОбъект.ОбменДанными.Загрузка = Истина;
						ДокОбъект.Записать();
					КонецПопытки;					
					
					ТекстПисьма = ТекстПисьма + " Ошибка обработки документа: № " + Выборка.Ссылка.Номер + " от "+ Выборка.Ссылка.Дата +"  Описание Ошибки: " +РезультатОбработки.Ошибки[0]  + Символы.ПС;	
					//Валетов + 12,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3187
					ТемаПисьма = "Ошибки регламентного задания при обработке Агрегаций "+ДокОшибки+ " по РНК "+ РезПоРНК.Ссылка +"  в базе  " + Маркировка_ПИ.ЭтотУзел_Код();
					ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибки);
				КонецЕсли;
				
				Прервать;
			КонецЦикла;
			
			Если ВсеДокументыОбработаны Тогда    
				//ПЕРЕВЕДЕНО В ДРУГОЕ РЕГ,ЗАДАНИЕ. ОМ.РЕГЛАМЕНТ.ПереводНакладныхИзОжиданияОбработкиЧЗвРГ()
				
				//НаборЗаписей = РегистрыСведений.СтатусГотовностиКОтгрузкеЧЗ.СоздатьНаборЗаписей();
				//НаборЗаписей.Отбор.Документ.Установить(РезПоРНК.Ссылка);
				//НаборЗаписей.Прочитать();
				//Если НаборЗаписей.Количество() = 0 Тогда
				//	НоваяЗапись = НаборЗаписей.Добавить();
				//	НоваяЗапись.Документ = РезПоРНК.Ссылка;
				//Иначе
				//	НоваяЗапись = НаборЗаписей[0];
				//КонецЕсли;
				//
				//НоваяЗапись.СтатусЧЗ = Перечисления.СтатусыГотовностиКОтгрузкеЧЗ.Обработано;
				//НаборЗаписей.Записать(); 
				
				////Валетов + 17,09,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-5404 
				//Если РезПоРНК.Ссылка.СостояниеНакладной = Перечисления.СостоянияНакладной.ОжиданиеОбработкиЧЗ Тогда
				//	РнкОбъект = РезПоРНК.Ссылка.ПолучитьОбъект();
				//	РнкОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
				//	Попытка 
				//		РнкОбъект.Записать(РежимЗаписиДокумента.Проведение); 
				//	Исключение  
				//		ЕстьОшибки = Истина;
				//		ТекстПисьма = ТекстПисьма + " Ошибка перевода в РГ документа: № "+ Выборка.Ссылка.Номер + " от "+ Выборка.Ссылка.Дата + Символы.ПС;
				//	КонецПопытки;
				//КонецЕсли;
				////Валетов - 
			КонецЕсли;        
			//Валетов + Пока перенес отправку писем выше
			//Если ЕстьОшибки Тогда
			//	ТемаПисьма = "Ошибки регламентного задания при обработке Агрегаций по РНК "+ДокОшибки+"  в базе  " + Маркировка_ПИ.ЭтотУзел_Код();
			//	ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибки);
			//КонецЕсли;
			
		КонецЦикла;//Цикл По РНК
		
	КонецЦикла;
		
КонецПроцедуры

Функция СделатьРазагрегацию(ДокСсылка,ЕстьОшибки,ТекстПисьма)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|ГДЕ
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование = &Док
	|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Проведен
	|	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.РасформированиеУпаковки)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка";
	
	Запрос.УстановитьПараметр("Док", ДокСсылка.ДокументОснование);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Документы.МаркировкаТоваровИСМП.ПустаяСсылка();
		
	Иначе
		
		рПолучения = Документы.МаркировкаТоваровИСМП.ПолучитьДанныеРазАгрегации(ДокСсылка.ДокументОснование);
		Если рПолучения.Успешно Тогда
			
			Если рПолучения.Данные.Количество() = 0 Тогда
				Возврат Документы.МаркировкаТоваровИСМП.ПустаяСсылка();			
			КонецЕсли;
			
			ДокМаркировкиОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();
			
			ДокМаркировкиОбъект.Дата	= ДокСсылка.дата - 2;			
			
			ДокМаркировкиОбъект.Организация	= ПолучитьРеквизитШапки(ДокСсылка, "Организация");
			ДокМаркировкиОбъект.Заполнить(ДокСсылка.ДокументОснование);
			ДокМаркировкиОбъект.ДокументОснование = ДокСсылка.ДокументОснование;
			ДокМаркировкиОбъект.ПодразделениеНанесения = ДокСсылка.ДокументОснование.Склад.Подразделение;
			ДокМаркировкиОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);
			
			ДокМаркировкиОбъект.ВидОперации		= Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки;
			ДокМаркировкиОбъект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки;
			ДокМаркировкиОбъект.Статус			= Перечисления.СтатусыДокументовМаркировки.КОбработке;
			
			Для Каждого ШтрихкодУпаковки Из рПолучения.Данные Цикл
				СтрокаТЧ = ДокМаркировкиОбъект.ШтрихкодыУпаковок.Добавить();
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;				
			КонецЦикла;
			
			Попытка
				ДокМаркировкиОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокМаркировкиОбъект.ОбменДанными.Загрузка = Истина;
				ДокМаркировкиОбъект.Записать();
				ЕстьОшибки = истина;
				ТекстПисьма = ТекстПисьма + " Ошибка проведения документа разагрегации: " + ДокМаркировкиОбъект.Ссылка +" Описание ошибки: " +ОписаниеОшибки() + Символы.ПС;
			КонецПопытки;
			Возврат ДокМаркировкиОбъект.Ссылка; 
		Иначе
			ЕстьОшибки = истина;
			ТекстПисьма = ТекстПисьма + " Ошибка разагрегации документа: " + ДокСсылка.ДокументОснование +" " + Символы.ПС;
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура ОповеститьОбОшибке(ТекстПисьма,ТемаПисьма,СписокПолучателей,ДокОшибкиСсылка)
	//Не шлем письма в течении 10 часов с последней записи с Документом Ошибки
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПисьмаНаОтправку.ДатаСозданияПисьма КАК ДатаСозданияПисьма,
	                |	ПисьмаНаОтправку.Основание КАК Основание
	                |ИЗ
	                |	РегистрСведений.ПисьмаНаОтправку КАК ПисьмаНаОтправку
	                |ГДЕ
	                |	ПисьмаНаОтправку.Основание = &ДокОсн
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ПисьмаНаОтправку.ДатаСозданияПисьма УБЫВ";
	Запрос.УстановитьПараметр("ДокОсн",ДокОшибкиСсылка);
	Рез = запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ТекущаяДата() - 3600 * 10 <= Рез.ДатаСозданияПисьма	Тогда
			Возврат;  //10 часов на обработку ошибки не прошло, пока не спамим...
		КонецЕсли;
	КонецЦикла;
	
	//Валетов + 02,09,2025 Поменял почту по просьбе Алексея Петрова
	СписокПолучателей.Добавить("mark@collant.ru");
	//Феданченков М.С. 10.06.2026 начало
	//наряд 0000001265
	СписокПолучателей.Добавить("tp@collant.ru");
	//Феданченков М.С. 10.06.2026 конец
	
	//Валетов -	
	//СписокПолучателей.Добавить("valetov@collant.ru");
	СформироватьВнутреннееУведомление(СписокПолучателей,ТекстПисьма,ТемаПисьма,ДокОшибкиСсылка);
	
КонецПроцедуры

Функция ЕстьДокументВОтложенныхДвижениях(ДокОМ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтложенныеДвиженияДокументов.ДокСсылка КАК ДокСсылка
	|ИЗ
	|	РегистрСведений.ОтложенныеДвиженияДокументов КАК ОтложенныеДвиженияДокументов
	|ГДЕ
	|	ОтложенныеДвиженияДокументов.ДокСсылка = &ДокОМ
	|	И НЕ ОтложенныеДвиженияДокументов.ОшибкаОбработки";
	Запрос.УстановитьПараметр("ДокОМ",ДокОМ);
	Результат = запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСУЗПоОрганизации(ОрганизацияСуз) Экспорт
	СУЗ = Справочники.СтанцииУправленияЗаказамиИСМП.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	СтанцииУправленияЗаказамиИСМП.Ссылка КАК Ссылка
	  |ИЗ
	  |	Справочник.СтанцииУправленияЗаказамиИСМП КАК СтанцииУправленияЗаказамиИСМП
	  |ГДЕ
	  |	СтанцииУправленияЗаказамиИСМП.Владелец.ИНН = &ИНН
	 // |	И СтанцииУправленияЗаказамиИСМП.Наименование ПОДОБНО &СтрокаПоиска
	  |	И НЕ СтанцииУправленияЗаказамиИСМП.Владелец.ПометкаУдаления
	  |	И СтанцииУправленияЗаказамиИСМП.СУЗДляОУКЭП";
	
	// Запрос.УстановитьПараметр("СтрокаПоиска", "Боевой%");
	 Запрос.УстановитьПараметр("ИНН",ОрганизацияСуз);
	 Результат = запрос.Выполнить().Выгрузить();
	 Для Каждого СТрРезультат ИЗ Результат Цикл
		 Суз = СТрРезультат.Ссылка;
	 КонецЦикла;
	Возврат Суз;
КонецФункции

	
Функция ПолучитьСписокСертификатовСИНН()  Экспорт
	Менеджер	= Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider","",80);
	Хранилище 	= Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	
	СписокСертификатов = Новый СписокЗначений;
	Для Каждого Сертификат Из Хранилище.ПолучитьВсе() Цикл		
		Если Сертификат.ИспользоватьДляПодписи И Сертификат.ДатаОкончания>=НачалоДня(ТекущаяДата()) Тогда
			Наименование = 	""+ ПолучитьЗначениеПараметра(Сертификат.Субъект, "OID1_2_643_100_4");
			СписокСертификатов.Добавить(ДвоичныеДанныевHEX(Сертификат.Отпечаток), Наименование);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СписокСертификатов;
КонецФункции

Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) 
	Возврат МаркировкаКС.ПолучитьЗначениеПараметра(СтруктураПараметров, Имя, ЗначениеПоУмолчанию);
КонецФункции

Функция ДвоичныеДанныевHEX(Данные) 
	Результат = "";
	
	КодыХЕКС = СтрРазделить("0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F", ",");
	
	ЧтениеДанных = Новый ЧтениеДанных(Данные);		
	Байт = ЧтениеДанных.ПрочитатьБайт();		
	Пока Байт <> Неопределено Цикл        	
		H 	= Цел(Байт / 16);
		L	= Байт % 16;
		
		Результат = Результат+КодыХЕКС[H]+КодыХЕКС[L];		
		Байт = ЧтениеДанных.ПрочитатьБайт();
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПроверитьТоварыПоРНК(РНК) 
	Запрос = Новый Запрос;  
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТоварыЛНЛП.Количество) КАК КолВо,
	|	ТоварыЛНЛП.Ссылка.ДокОснование КАК ДокОснование
	|ИЗ
	|	Документ.ЛистНабора.Товары КАК ТоварыЛНЛП
	|ГДЕ
	|	ТоварыЛНЛП.Ссылка.ДокОснование = &ДокОснование
	|	И НЕ ТоварыЛНЛП.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЛНЛП.Ссылка.ДокОснование";
	Запрос.УстановитьПараметр("ДокОснование", РНК);
	Если МаркировкаС.ЕстьЛПСКодамиЧЗ(РНК) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,".ЛистНабора.",".ЛистПереукладки.");
	КонецЕсли; 
	
	Результат = запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.КолВо;
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции
//Валетов -
